УТ_для_edt.РасширениеСмарт/src/Documents/ПоступлениеБезналичныхДенежныхСредств/ПоступлениеБезналичныхДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПоступлениеБезналичныхДенежныхСредств</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВалютаКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроведеноБанком</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИдентификаторПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодтверждениеЗачисленияЗарплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>БанковскийСчетОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипПлатежногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПроведенияБанком</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассаОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяАктивовПассивов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КурсКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СуммаКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смарт_ОплаченоЧерезКассуБанка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДанныеВыписки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e745a4f7-e3f0-43f6-9a5f-7aef0bc51a0b">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Заказ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Организация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДоговорКредитаДепозита</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ОснованиеПлатежа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДоговорЗаймаСотруднику</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ТипСуммыКредитаДепозита</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВалютаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяДоходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаДоходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9c833630-69a2-4041-a061-4deff13f755d">
      <name>смартКурсДокумента</name>
      <comment>#1320 смарт: Лопато 01.03.2023 //Изменить порядок вычисленя Курса и Суммы взаиморасчета в валюте</comment>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СостоянияЗаказовКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes>
    <name>СуммаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДолга</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроцентОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПроцентОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПроцентДолга</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЕстьРасхожденияОрдерНакладная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/Enums/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СостоянияЗаказовКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Закрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Documents/ПоступлениеБезналичныхДенежныхСредств/Forms/ФормаДокумента/Module.bsl
#Область ПеренесеноСДоработками

#КонецОбласти 

#Область ДоработкиСмарт

// Фролов+
&НаКлиенте
Процедура смарт_РасшифровкаПлатежаСуммаОбработкаВыбораПеред(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если смартКэшСуммыРасшифровкиПлатежа=0 Тогда 
		смартКэшСуммыРасшифровкиПлатежа=Элементы.РасшифровкаПлатежа.ТекущиеДанные.Сумма;
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура смарт_РасшифровкаПлатежаСуммаАвтоПодборПеред(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если смартКэшСуммыРасшифровкиПлатежа=0 Тогда 
		смартКэшСуммыРасшифровкиПлатежа=Элементы.РасшифровкаПлатежа.ТекущиеДанные.Сумма;
	КонецЕсли;		
КонецПроцедуры
// Фролов-

&НаСервере
Процедура УстановитьДоступностьПоПризнакуОплатыЧерезКассу()
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьДоступностьПлатежныхРеквизитов(Объект.смарт_ОплаченоЧерезКассуБанка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПлатежныхРеквизитов(РазрешитьИзменения)
	
	Элементы.Контрагент.ТолькоПросмотр = Не РазрешитьИзменения;
	Элементы.БанковскийСчетКонтрагента.ТолькоПросмотр = Не РазрешитьИзменения;
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_смарт_ОплаченоЧерезКассуБанкаПриИзмененииПосле(Элемент)
	РазрешитьРедактированиеПлатежныхРеквизитов = Объект.смарт_ОплаченоЧерезКассуБанка;
	
	Если Не РазрешитьРедактированиеПлатежныхРеквизитов Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеЗакрытияВопроса",ЭтаФорма,Новый Структура("РазрешитьИзменения",РазрешитьРедактированиеПлатежныхРеквизитов)),
						"Внимание!
						|После снятия признака,
						|при повторной загрузке данных из клиент-банка
						|документ будет помечен как непроведенный банком!
						|Продолжить выполнение операции?", Режим);		
	Иначе
		УстановитьДоступностьПлатежныхРеквизитов(РазрешитьРедактированиеПлатежныхРеквизитов);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат,ДопПараметры)Экспорт 
	Если Результат=КодВозвратаДиалога.Нет Тогда 
		Объект.смарт_ОплаченоЧерезКассуБанка=Истина;
	Иначе
		УстановитьДоступностьПлатежныхРеквизитов(ДопПараметры.РазрешитьИзменения);
	КонецЕсли;	
КонецПроцедуры	

// Фролов+
&НаКлиенте
Процедура РасшифровкаПлатежаКурсПриИзменении(Элемент)
	ПересчитатьСуммуВзаиморасчетовИКурс(Элементы.РасшифровкаПлатежа.ТекущиеДанные.ПолучитьИдентификатор(),Элемент.Имя);
КонецПроцедуры	

&НаСервере
Процедура смартПересчитатьКурс()
	Для Каждого Стр Из Объект.РасшифровкаПлатежа Цикл 
		//++#1320 смарт: Лопато 01.03.2023 //Изменить порядок вычисленя Курса и Суммы взаиморасчета в валюте  
		Если Объект.смартРасчетОтКурса И НЕ Стр.смартКурсДокумента = 0 Тогда
			Стр.СуммаВзаиморасчетов = ?(Стр.смартКурсДокумента = 0, 0, Стр.Сумма / Стр.смартКурсДокумента);
		Иначе
			Стр.смартКурсДокумента = ?(Стр.СуммаВзаиморасчетов = 0, 0, Стр.Сумма / Стр.СуммаВзаиморасчетов);
		КонецЕсли;	
		//--#1320 смарт: Лопато 01.03.2023
	КонецЦикла;
КонецПроцедуры	
// Фролов-

&НаКлиенте
Процедура смартДействиеПоказатьИнформацию(Команда)
//++#1320 смарт: Лопато 01.03.2023 //Изменить порядок вычисленя Курса и Суммы взаиморасчета в валюте  
	
	Если СтрНайти(Команда.Имя, "смартРасчетОтКурса") <> 0 Тогда

		ИнформацияЗаголовок = "Расчет от курса";

		ИнформацияТекст = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
			  НСтр("ru = 'Выберите это значение, если нужно изменить порядок вычисления.'")
			+ Символы.ПС
			+ Символы.ПС
			+ НСтр("ru = 'По-умолчанию курс рассчитывается как'")
			+ Символы.ПС
			+ НСтр("ru = '<b>Сумма оплаты (руб) / Сумма взаиморасчетов = Курс</b>'")
			);

	Иначе
		ИнформацияЗаголовок = "";
		ИнформацияТекст = "";	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИнформацияЗаголовок) И ЗначениеЗаполнено(ИнформацияТекст) Тогда
		ОткрытьФорму("ОбщаяФорма.смартФормаИнформацияПоДоработкам", Новый Структура("Заголовок, Информация", ИнформацияЗаголовок, ИнформацияТекст), ЭтаФорма);
	КонецЕсли;

КонецПроцедуры //--#1320 смарт: Лопато 01.03.2023

//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств
//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо) 
// Смарт Фролов+
// Смарт Функция проверки возможности изменения табличной части "Расшифровка платежа"
// Входной параметр Стр - строка табличной части в которой происходт изменение; ИмяЭлемента - имя элемента формы
// Возвращаемое значение Булево
&НаКлиенте
Функция смартВозможностьИзмененияРасшифровкиПлатежа(Стр, ИмяЭлемента = "")
	
	ИзменятьМожно = Истина;
	
	Если ТипЗнч(Стр.ОснованиеПлатежа) = Тип("ДокументСсылка.ЗаказКлиента") Тогда 
		
		ДанныеЗаказа =смартПолучитьДанныеЗаказа(Стр.ОснованиеПлатежа, ?(Объект.ПроведеноБанком, Объект.ДатаПроведенияБанком, Объект.Дата), Объект.Валюта);
		
		Если ДанныеЗаказа.ПолныеПрава Тогда 
			Возврат Истина;
		КонецЕсли;	
		
		Если ДанныеЗаказа.Закрыт Тогда  // Пока только по "Закрытым заказам"
			ИзменятьМожно = Ложь; 
			смартВывестиСообщениеИОбновитьЭлементыФормы("Изменение оплаты по закрытому заказу запрещено!", ИмяЭлемента, Стр.ПолучитьИдентификатор());	
		КонецЕсли;	  
		
	КонецЕсли;
	
	Возврат ИзменятьМожно; 
	
КонецФункции // Фролов- //-- #Б-960 смарт: Мосолов 23.09.2024 

//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств
//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо) 
// Смарт Фролов+
&НаСервере
Процедура смартДозаполнитьДанныеСтроки(ИД) 
	
	Стр = Объект.РасшифровкаПлатежа.НайтиПоИдентификатору(ИД);
	
	Если Объект.Валюта = Стр.ВалютаВзаиморасчетов Тогда
		Стр.СуммаВзаиморасчетов = Стр.Сумма;
	Иначе	
		//++#1320 смарт: Лопато 01.03.2023 //Изменить порядок вычисленя Курса и Суммы взаиморасчета в валюте  
		Если Объект.смартРасчетОтКурса Тогда
			Стр.СуммаВзаиморасчетов = ?(Стр.смартКурсДокумента = 0, 0, Стр.Сумма / Стр.смартКурсДокумента);
		Иначе
			ДанныеВалютыДок = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.Валюта, ?(Объект.ПроведеноБанком, Объект.ДатаПроведенияБанком, Объект.Дата));
			ДанныеВалютыВзаиморасчетов = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Стр.ВалютаВзаиморасчетов, ?(Объект.ПроведеноБанком, Объект.ДатаПроведенияБанком, Объект.Дата));
			Стр.смартКурсДокумента = ДанныеВалютыВзаиморасчетов.Курс;
			Стр.СуммаВзаиморасчетов = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.Сумма, ДанныеВалютыДок, ДанныеВалютыВзаиморасчетов);
		КонецЕсли;	
		//--#1320 смарт: Лопато 01.03.2023
	КонецЕсли;		
	
	ПересчитатьСуммуВзаиморасчетовИКурс(ИД, "РасшифровкаПлатежаСумма");
	
	Если Не ЗначениеЗаполнено(Стр.СтатьяДвиженияДенежныхСредств) Тогда 
		Стр.СтатьяДвиженияДенежныхСредств = ДенежныеСредстваСервер.СтатьяДвиженияДенежныхСредствОбъектаРасчетов(Стр.ОснованиеПлатежа, Объект.ХозяйственнаяОперация);
	КонецЕсли;
	
КонецПроцедуры // Фролов- //-- #Б-960 смарт: Мосолов 23.09.2024	

//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств
//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо) 
// Смарт Фролов+
&НаСервере
Процедура ПересчитатьСуммуВзаиморасчетовИКурс(ИдСтроки, ЭлементОснование)
	
	Стр = Объект.РасшифровкаПлатежа.НайтиПоИдентификатору(ИдСтроки);   
	
	Если ЭлементОснование = "РасшифровкаПлатежаСумма" 
		Или ЭлементОснование = "РасшифровкаПлатежаСуммаВзаиморасчетов" 
		//++#1320 смарт: Лопато 01.03.2023 //Изменить порядок вычисленя Курса и Суммы взаиморасчета в валюте  
		Или ЭлементОснование = "РасшифровкаБезРазбиенияСуммаВзаиморасчетов"
		Или ЭлементОснование = "РасшифровкаБезРазбиенияОснованиеПлатежа" 
		Или ЭлементОснование = "РасшифровкаПлатежаОснованиеПлатежа" Тогда  
		
		Если Объект.смартРасчетОтКурса Тогда
			Стр.СуммаВзаиморасчетов = ?(Стр.смартКурсДокумента = 0, 0, Стр.Сумма / Стр.смартКурсДокумента);
		Иначе
			Стр.смартКурсДокумента = ?(Стр.СуммаВзаиморасчетов = 0, 0, Стр.Сумма / Стр.СуммаВзаиморасчетов);
		КонецЕсли;	
		//--#1320 смарт: Лопато 01.03.2023   
		
	ИначеЕсли ЭлементОснование = "РасшифровкаПлатежаКурс" Или ЭлементОснование = "РасшифровкаБезРазбиенияКурс" Тогда 	
		Стр.СуммаВзаиморасчетов = ?(Стр.смартКурсДокумента = 0, 0, Стр.Сумма / Стр.смартКурсДокумента);
	КонецЕсли;	      
	
КонецПроцедуры // Фролов- //-- #Б-960 смарт: Мосолов 23.09.2024

//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств
//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо)
// Смарт Фролов+
// Функция получает данные по заказу клиента
// Входные параметры: Заказ - Ссылка на на Заказ клиента; ДатаОплаты - Дата документа оплаты; Валюта - валюта документа оплаты
// Возвращаемое значение: Структура
&НаСервереБезКонтекста
Функция смартПолучитьДанныеЗаказа(Заказ, ДатаОплаты, Валюта)	
	ДанныеЗаказа = Новый Структура("ПолныеПрава, Закрыт, Сальдо, СуммаОтгрузки, СуммаОплатыВВалютеЗаказа, СуммаОплатыВВалютеОплаты", РольДоступна("ПолныеПрава"), Ложь);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("Дата", ДатаОплаты);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	СостоянияЗаказовКлиентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.Закрыт) КАК Закрыт,
	|	ВЫРАЗИТЬ((СостоянияЗаказовКлиентов.СуммаОплаты - СостоянияЗаказовКлиентов.СуммаОтгрузки) * (ЕСТЬNULL(КурсЗаказа.Курс, 1) * ЕСТЬNULL(КурсЗаказа.Кратность, 1)) / (ЕСТЬNULL(КурсОплаты.Курс, 1) * ЕСТЬNULL(КурсОплаты.Кратность, 1)) КАК ЧИСЛО(15, 2)) КАК Сальдо,
	|	СостоянияЗаказовКлиентов.СуммаОтгрузки КАК СуммаОтгрузки,
	|	СостоянияЗаказовКлиентов.СуммаОплаты КАК СуммаОплатыВВалютеЗаказа,
	|	ВЫРАЗИТЬ(СостоянияЗаказовКлиентов.СуммаОплаты * (ЕСТЬNULL(КурсЗаказа.Курс, 1) * ЕСТЬNULL(КурсЗаказа.Кратность, 1)) / (ЕСТЬNULL(КурсОплаты.Курс, 1) * ЕСТЬNULL(КурсОплаты.Кратность, 1)) КАК ЧИСЛО(15, 2)) КАК СуммаОплатыВВалютеОплаты
	|ИЗ
	|	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта) КАК КурсОплаты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсЗаказа
	|		ПО (СостоянияЗаказовКлиентов.Заказ.Валюта = КурсЗаказа.Валюта)
	|ГДЕ
	|	СостоянияЗаказовКлиентов.Заказ = &Заказ";
	
	Рез = Запрос.Выполнить().Выбрать(); 
	
	Если Рез.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(ДанныеЗаказа, Рез);
	КонецЕсли;
	
	Возврат ДанныеЗаказа;  
	
КонецФункции // Фролов- //-- #Б-960 смарт: Мосолов 23.09.2024

//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств
//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо)
// Смарт Процедура вывода сообщения об ошибке и обновления элементов формы
// Входные параметры: ТекстСообщения - текст; ИмяЭлемента - имя элемента формы; ИДСтр - идентификатор строки табличной части "Расшифровка платежа"
&НаКлиенте
Процедура смартВывестиСообщениеИОбновитьЭлементыФормы(ТекстСообщения,ИмяЭлемента,ИДСтр) 
	
	Если ПереключательРасшифровки = 0 Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ИмяЭлемента);
		ЭтаФорма.ОбновитьОтображениеДанных(Элементы.РасшифровкаБезРазбиения);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , "Объект.РасшифровкаПлатежа[" + ИДСтр + "].ОснованиеПлатежа");
		Элементы.РасшифровкаПлатежа.ЗакончитьРедактированиеСтроки(Истина);
		Элементы.РасшифровкаПлатежа.Обновить();
	КонецЕсли;	 
	
КонецПроцедуры // Фролов- //-- #Б-960 смарт: Мосолов 23.09.2024

//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств
//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо)
// Смарт Процедура вывода сообщения об ошибке и обновления элементов формы
// Входные параметры: ТекстСообщения - текст; ИмяЭлемента - имя элемента формы; ИДСтр - идентификатор строки табличной части "Расшифровка платежа"
&НаКлиенте
&ИзменениеИКонтроль("РасшифровкаПлатежаОснованиеПлатежаОбработкаВыбора")
Процедура смарт_РасшифровкаПлатежаОснованиеПлатежаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь; 
	
	СтрокаТаблицы = Элементы.РасшифровкаПлатежа.ТекущиеДанные; 
	
	#Вставка
	//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств
	//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо) 
	// Смарт Фролов+ Задача № 78
	Если Не смартВозможностьИзмененияРасшифровкиПлатежа(СтрокаТаблицы,Элемент.Имя) Тогда 
		Возврат; 
	КонецЕсли;	
	// Фролов-
	//-- смарт:ММ 27.03.2020
	//-- #Б-960 смарт: Мосолов 23.09.2024
	#КонецВставки

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда

		ДополнитьВыбранноеЗначениеДаннымиНДС(ВыбранноеЗначение);

		ИсключаемыеСвойства = "";
		Если ВыбранноеЗначение.Свойство("СтатьяДвиженияДенежныхСредств")
			И НЕ ЗначениеЗаполнено(ВыбранноеЗначение.СтатьяДвиженияДенежныхСредств) Тогда
			ИсключаемыеСвойства = "СтатьяДвиженияДенежныхСредств";
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыбранноеЗначение, , ИсключаемыеСвойства);

		Модифицированность = Истина;

		#Удаление
		ОбновитьНДССтрокиНаСервере(СтрокаТаблицы.ПолучитьИдентификатор());
        #КонецУдаления
		
		#Вставка
		//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств
		//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо) 
		// Смарт Фролов+ НДС пересчитываем всегда
		//Если Не ЗначениеЗаполнено(СтрокаТаблицы.СуммаНДС) Тогда
		// Фролов-
		//-- смарт:ММ 27.03.2020
		СтруктураПересчетаСуммы = Новый Структура;
		СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Истина);
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТаблицы, СтруктураДействий, КэшированныеЗначения);
		//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо) 	
		// Смарт Фролов+	
		//КонецЕсли;
		// Фролов-
		//-- смарт:ММ 27.03.2020
		СформироватьНадписьГиперссылкиРеквизитыОбъектаРасчетов();
		УстановитьВидимостьДоступностьЭлементовРасшифровкиБезРазбиения();

		//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо) 
		// Смарт Фролов+
		смартДозаполнитьДанныеСтроки(СтрокаТаблицы.ПолучитьИдентификатор());
		// Фролов-
		//-- смарт:ММ 27.03.2020
		//-- #Б-960 смарт: Мосолов 23.09.2024
		#КонецВставки
		
	КонецЕсли;

КонецПроцедуры //-- #Б-960 смарт: Мосолов 23.09.2024

//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств
&НаКлиенте
&ИзменениеИКонтроль("СуммаДокументаПриИзменении")
Процедура смарт_СуммаДокументаПриИзменении(Элемент)

	ФинансыКлиентСервер.ПересчитатьСуммыВСтрокеРасшифровкиПлатежа(Объект, Объект.СуммаДокумента, Ложь);
	СуммаДокументаПриИзмененииСервер();
	
	#Вставка
	//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств 
	
	//смартФролов+
	смартПересчитатьКурс();
	// Фролов - 
	
	//-- #Б-960 смарт: Мосолов 23.09.2024
	#КонецВставки
	
КонецПроцедуры //-- #Б-960 смарт: Мосолов 23.09.2024

//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);

	// Обработчик подсистемы "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
		Если Параметры.Свойство("Основание") Тогда
			Основание = Параметры.Основание;
		КонецЕсли;
	КонецЕсли;

	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПриСозданииНаСервереДокумент(ЭтотОбъект, Параметры);
	ПроверкаКонтрагентовВызовСервераПереопределяемыйУТ.ФормаДокументаПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборот.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ИнтеграцияС1СДокументооборотом

	// Обработчик механизма "Свойства"
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", Объект);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеПараметры);

	// ИнтернетПоддержкаПользователей.СПАРКРиски, ПриСозданииНаСервере.
	ПараметрыПроцедуры = Новый Структура("ВариантОтображения", "Однострочный");
	СПАРКРиски.ПриСозданииНаСервере(
	ЭтотОбъект,
	Неопределено,
	Объект.Контрагент,
	Перечисления.ЮрФизЛицо.ВидКонтрагентаСПАРКРиски(Объект.Контрагент),
	ПараметрыПроцедуры);
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски, ПриСозданииНаСервере.

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка); 
	
	#Вставка
	//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств
	
	УстановитьДоступностьПоПризнакуОплатыЧерезКассу();
	// Фролов+
	смартПересчитатьКурс();	
	// Фролов-

	//++#1320 смарт: Лопато 01.03.2023 //Изменить порядок вычисленя Курса и Суммы взаиморасчета в валюте  
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартГруппаДополнительно", Тип("ГруппаФормы"), ЭтаФорма.Элементы.СтраницаРасшифровка,  ЭтаФорма.Элементы.СтраницыРасшифровки);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
	
	Элементы.Переместить(Элементы.ПереключательРасшифровки, ЭтаФорма.Элементы.смартГруппаДополнительно);
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартРасчетОтКурса", Тип("ПолеФормы"), ЭтаФорма.Элементы.смартГруппаДополнительно);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.смартРасчетОтКурса";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	смартСервер.смартДобавитьКнопкуИнформацииНаФорму("смартРасчетОтКурса", "поле ""Расчет от курса""", 
													 ЭтаФорма.Элементы.смартГруппаДополнительно, ЭтаФорма);
	//--#1320 смарт: Лопато 01.03.2023
	
	//-- #Б-960 смарт: Мосолов 23.09.2024
	#КонецВставки

КонецПроцедуры //-- #Б-960 смарт: Мосолов 23.09.2024

//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств
&НаСервере
&ИзменениеИКонтроль("ПередЗаписьюНаСервере")
Процедура смарт_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// Обработчик механизма "Свойства"
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);

	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПередЗаписьюНаСервереДокумент(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборот.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом   
	
	#Вставка
	//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств   
	
	//++#1320 смарт: Лопато 01.03.2023 //Изменить порядок вычисленя Курса и Суммы взаиморасчета в валюте  
	смартПересчитатьКурс();
	//--#1320 смарт: Лопато 01.03.2023
	
	// Смарт Фролов+ Кэшируем данные суммы взаиморасчетов
	смартКэшРасшифровки.Очистить();
	Для Каждого Стр Из Объект.РасшифровкаПлатежа Цикл 
		смартКэшРасшифровки.Вставить(Объект.РасшифровкаПлатежа.Индекс(Стр), Стр.СуммаВзаиморасчетов);
		Стр.СуммаВзаиморасчетов = 0;
	КонецЦикла;	
	// Фролов-
	
	//-- #Б-960 смарт: Мосолов 23.09.2024
	#КонецВставки

КонецПроцедуры //-- #Б-960 смарт: Мосолов 23.09.2024

//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств
&НаСервере
&ИзменениеИКонтроль("ПослеЗаписиНаСервере")
Процедура смарт_ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами	

	ПланыВидовХарактеристик.СтатьиДоходов.ЗаполнитьПризнакАналитикаДоходовОбязательна(Объект.РасшифровкаПлатежа);
	ДоходыИРасходыСервер.ЗаполнитьТипСтатьи(Объект.РасшифровкаПлатежа, "СтатьяДоходов");

	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);

	Если ЗначениеЗаполнено(ЗеркальныйПлатежСсылка) 
		И Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойОрганизации Тогда
		СоответствуетЗеркальномуПлатежу = Документы.ПоступлениеБезналичныхДенежныхСредств.СоответствуетЗеркальномуПлатежу(
		Объект.Ссылка,ЗеркальныйПлатежСсылка);
	КонецЕсли;
	
	#Вставка
	//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств  
	
	//смартФролов+
	// Проверяем не изменились ли данные суммы взаиморасчетов после записи на сервере 
	Для Каждого Стр Из Объект.РасшифровкаПлатежа Цикл
		ЭлСписка=смартКэшРасшифровки[Объект.РасшифровкаПлатежа.Индекс(Стр)];
		СообщениеПользователю = "";
		Если ЭлСписка=Неопределено Тогда 
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка! Из-за не совпадения индексов строк ДО и ПОСЛЕ записи документа,
																| не удалось найти строку в данных до записи.");  
			
		ИначеЕсли Не ЭлСписка.Значение = Стр.СуммаВзаиморасчетов Тогда 
			
			СообщениеПользователю = "Для основания платежа "+Стр.ОснованиеПлатежа+" изменилась сумма взаиморасчетов.
									| Сумма взаиморасчетов в строке имеет отличия после записи документа.";  
			
			Если ЭлСписка.Значение = 0 Тогда
				СообщениеПользователю = "";
				//СообщениеПользователю = СообщениеПользователю + " Поле Сумма Взаиморасчетов не было заполнено до проведения документа";
			Иначе
				СообщениеПользователю = СообщениеПользователю + " Это может быть вызвано ошибкой доработанного функционала предварительного расчета суммы взаиморасчетов";
			КонецЕсли;				
		КонецЕсли;
		
		Если НЕ СообщениеПользователю = "" Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеПользователю);
		КонецЕсли;
	КонецЦикла;
	
	//-- #Б-960 смарт: Мосолов 23.09.2024
	#КонецВставки

КонецПроцедуры //-- #Б-960 смарт: Мосолов 23.09.2024

//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств
&НаКлиенте
&ИзменениеИКонтроль("РасшифровкаПлатежаСуммаПриИзменении")
Процедура смарт_РасшифровкаПлатежаСуммаПриИзменении(Элемент)

	СтрокаТаблицы = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	СтрокаТаблицы.СуммаВзаиморасчетов = 0;

	СтруктураПересчетаСуммы = Новый Структура;
	СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Истина);
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТаблицы, СтруктураДействий, КэшированныеЗначения);

	СформироватьНадписьГиперссылкиРеквизитыОбъектаРасчетов();
	
	#Вставка
	//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств  
	
	//смартФролов +
	Стр=Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	Если Не смартКэшСуммыРасшифровкиПлатежа = Стр.Сумма Тогда 
		
		Если Не смартВозможностьИзмененияРасшифровкиПлатежа(Стр, "Сумма") Тогда 
			Стр.Сумма = смартКэшСуммыРасшифровкиПлатежа;
			смартКэшСуммыРасшифровкиПлатежа = 0;
		КонецЕсли;	  
		
	КонецЕсли;
	
	смартДозаполнитьДанныеСтроки(Стр.ПолучитьИдентификатор());	
	ПересчитатьСуммуВзаиморасчетовИКурс(Стр.ПолучитьИдентификатор(), Элемент.Имя);
	
	Элементы.РасшифровкаПлатежа.Обновить();
	// Фролов -
	
	//-- #Б-960 смарт: Мосолов 23.09.2024
	#КонецВставки
	
КонецПроцедуры //-- #Б-960 смарт: Мосолов 23.09.2024

//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств
&НаКлиенте
&ИзменениеИКонтроль("РасшифровкаПлатежаСуммаВзаиморасчетовПриИзменении")
Процедура смарт_РасшифровкаПлатежаСуммаВзаиморасчетовПриИзменении(Элемент)

	СтрокаТаблицы = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаТаблицы.СуммаВзаиморасчетов)
		И СтрокаТаблицы.ВалютаВзаиморасчетов = Объект.Валюта
		И СтрокаТаблицы.СуммаВзаиморасчетов <> СтрокаТаблицы.Сумма Тогда
		СтрокаТаблицы.СуммаВзаиморасчетов = СтрокаТаблицы.Сумма;
	КонецЕсли;
	
	#Вставка
	//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств  
	
	//смартФролово+
	ПересчитатьСуммуВзаиморасчетовИКурс(Элементы.РасшифровкаПлатежа.ТекущиеДанные.ПолучитьИдентификатор(), Элемент.Имя);
	//Фролов-
	
	//-- #Б-960 смарт: Мосолов 23.09.2024
	#КонецВставки
	
КонецПроцедуры //-- #Б-960 смарт: Мосолов 23.09.2024

//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств
&НаКлиенте
&ИзменениеИКонтроль("РасшифровкаПлатежаОснованиеПлатежаПриИзменении")
Процедура смарт_РасшифровкаПлатежаОснованиеПлатежаПриИзменении(Элемент)

	СтрокаТаблицы = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	СтрокаТаблицы.СуммаВзаиморасчетов = 0;
	СтрокаТаблицы.ВалютаВзаиморасчетов = Неопределено;

	Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ОснованиеПлатежа) И ИспользоватьЗаказы Тогда
		СтрокаТаблицы.Заказ = Неопределено;
		ФинансыКлиент.УстановитьПустуюСсылкуНаЗаказ(СтрокаТаблицы.Заказ, ФинансыКлиент.ЭтоРасчетыСКлиентами(Объект.ХозяйственнаяОперация));
	КонецЕсли;

	#Удаление
	РасшифровкаПлатежаОснованиеПлатежаПриИзмененииНаСервере(СтрокаТаблицы.ПолучитьИдентификатор())
	#КонецУдаления
	
	#Вставка
	//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств  
	
	РасшифровкаПлатежаОснованиеПлатежаПриИзмененииНаСервере(СтрокаТаблицы.ПолучитьИдентификатор());
	
	//смартФролов+
	ПересчитатьСуммуВзаиморасчетовИКурс(Элементы.РасшифровкаПлатежа.ТекущиеДанные.ПолучитьИдентификатор(), Элемент.Имя);
	//Фролов-
	
	//-- #Б-960 смарт: Мосолов 23.09.2024
	#КонецВставки
	
КонецПроцедуры //-- #Б-960 смарт: Мосолов 23.09.2024

//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств
&НаСервере
&ИзменениеИКонтроль("ПолучитьРасшифровкуПлатежаИзХранилища")
Процедура смарт_ПолучитьРасшифровкуПлатежаИзХранилища(АдресПлатежейВХранилище)

	Объект.РасшифровкаПлатежа.Загрузить(ПолучитьИзВременногоХранилища(АдресПлатежейВХранилище));
	
	#Вставка
	//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств  
	
	//смартФролов+
	Для Каждого Стр Из Объект.РасшифровкаПлатежа Цикл 
		Стр.СуммаНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(Стр.Сумма, УчетНДСУПКлиентСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС));
	КонецЦикла;
	//Фролов-
	
	//-- #Б-960 смарт: Мосолов 23.09.2024
	#КонецВставки
	
КонецПроцедуры //-- #Б-960 смарт: Мосолов 23.09.2024

//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств
&НаСервере
&ИзменениеИКонтроль("СуммаДокументаПриИзмененииСервер")
Процедура смарт_СуммаДокументаПриИзмененииСервер()

	Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.КонвертацияВалюты Тогда
		ПересчитатьПараметрыКонвертации("КурсКонвертации");
	КонецЕсли;

	Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПогашениеЗаймаСотрудником
		И Объект.СуммаДокумента > 0 Тогда

		РаспределитьСуммуНаСервере();
		ИнициализироватьРасшифровкуПлатежа();
		УправлениеЭлементамиФормы();
	КонецЕсли;

	ПараметрыПересчетаНДС = Новый Структура("ЦенаВключаетНДС", Истина);
	СтруктураДействий = Новый Структура("ПересчитатьСуммуНДС", ПараметрыПересчетаНДС);
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.РасшифровкаПлатежа, СтруктураДействий, Неопределено);

	СформироватьНадписьГиперссылкиРеквизитыОбъектаРасчетов();
	УстановитьВидимостьДоступностьЭлементовРасшифровкиБезРазбиения();

	ЗаполнитьДокументВыдачи();    
	
	#Вставка
	//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств  
	
	//++#1320 смарт: Лопато 01.03.2023 //Изменить порядок вычисленя Курса и Суммы взаиморасчета в валюте  
	смартПересчитатьКурс();
	//--#1320 смарт: Лопато 01.03.2023
	
	//-- #Б-960 смарт: Мосолов 23.09.2024
	#КонецВставки

КонецПроцедуры //-- #Б-960 смарт: Мосолов 23.09.2024

//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств
&НаСервере
&ИзменениеИКонтроль("ПриЗаписиНаСервере")
Процедура смарт_ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	#Вставка
	//++ #Б-960 смарт: Мосолов 23.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоступлениеБезналичныхДенежныхСредств  
	
	Для Каждого Стр Из ТекущийОбъект.РасшифровкаПлатежа Цикл 
		//++#1320 смарт: Лопато 01.03.2023 //Изменить порядок вычисленя Курса и Суммы взаиморасчета в валюте  
 		Если ТекущийОбъект.смартРасчетОтКурса И НЕ Стр.смартКурсДокумента = 0 Тогда
			Стр.СуммаВзаиморасчетов = ?(Стр.смартКурсДокумента = 0, 0, Стр.Сумма / Стр.смартКурсДокумента);
		Иначе
			Стр.смартКурсДокумента = ?(Стр.СуммаВзаиморасчетов = 0, 0, Стр.Сумма / Стр.СуммаВзаиморасчетов);
		КонецЕсли;	
		//--#1320 смарт: Лопато 01.03.2023
	КонецЦикла;
	
	//-- #Б-960 смарт: Мосолов 23.09.2024
	#КонецВставки
	
	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПриЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

	// ИнтернетПоддержкаПользователей.СПАРКРиски
	СПАРКРиски.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски

КонецПроцедуры //-- #Б-960 смарт: Мосолов 23.09.2024

#КонецОбласти
